#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Freddy_Office01_AnimBp.Freddy_Office01_AnimBp_C
// 0x1B0C (0x1E6C - 0x0360)
class UFreddy_Office01_AnimBp_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_7676226D45AC650157021591F7866A4C;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4D24FB9347076D7CD0C567A20A54BD35;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EBFB78604D42FE99D9D126AC812ACD6B;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F5BA2814D94BF1602A8CF97558970B0;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C9E886843DE54D129603BAB7C61F42C;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EDDB609040CF1E5AA071469517D5D09D;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5E24C7614FA6F9C6F53F8A8DD3C57641;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_404B12CD4C952F56EE8479AE96B4F37C;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_580EF2844CEE33E833BF40A0BEFC626E;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_586E1FDA450B57E87085199D36D01B52;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A866127B4D3DA3CD9BE602A32B3F6063;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_317B05454CCEF9AB8B41298F21F0BAF7;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C8D780744AA050804789D7BCE1AC5ECC;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2EEBF5F9429DD69F39C10FA7389379BA;// 0x0708(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FCE1C3044E596E43E1D566B2C94854E0;// 0x0750(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F8CBEFCA44A43C291732759107E99DA8;// 0x0888(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9BF3EEB14CDB46B682D7308EB6D2B6EE;// 0x08C8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7FDFBF424381F171BEB31EBD52E05B00;// 0x0908(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6DAABBF64B0DEE3955169DA6D4F990A6;// 0x0A40(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D940F57F4811BB50D9B361A106C3484C;// 0x0AE0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C4EAF8E14BE10EB788E519A44A892B82;// 0x0B20(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_32C4ED0248239BF9B59358B898A2B4F6;// 0x0B60(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_77A15E4F402EDF372EB9AEA11172A196;// 0x0BA0(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C0571D08414EFC44F86875B29BC1730B;// 0x0CD8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9537754247B2E4404E79E0AB7EA261BE;// 0x0D78(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_AD307CC045A2E6FB799673B15FF845E4;// 0x0DB8(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_67756170444840BBBE92149701C4915E;// 0x0DF8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9799FFB343D6E5D20D3F83B0DC7FD48F;// 0x0E38(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B6E864FC4DD1A8F0B75EF892D5668347;// 0x0F70(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_530BE85B4CB56064B8EDB18492E51BA6;// 0x1010(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_063A1B5B46168DEFB9F93382886CA873;// 0x1050(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C59BB2DF4709FBEBA3943C8FEA2635AC;// 0x1090(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_033B1E644A3375DA32785F8D21AFF6CA;// 0x10D0(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2AC9FC84D372A1DEC2D2E985EBC52E6;// 0x1208(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_062283264DDD572C28A6A4B60F5F8DF1;// 0x12A8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0F4DECC24852EEEBA996C0B9E0586735;// 0x12E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8FD58638486B0A42A35A18BF8DA03C71;// 0x1388(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C48AE2254327D5C8E0DEBBB458458912;// 0x13C8(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9634C1DF4F37C7F19949D4AEB620B9EF;// 0x1408(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9C41FED94AF4E4B9C42132B47D02CE9A;// 0x1448(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6913BE494EE9E14D1DD7EDB4590D0841;// 0x1580(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7F3D46174A50FE484FB11589F88DD608;// 0x1620(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_ABEC9E1345A512851A8FF4A12492C761;// 0x1660(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8E7BC9EF49F3CD895EBA5F9926B4DA30;// 0x1700(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4337E9E44AA4C9E90E2C5580C3349A50;// 0x1740(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A8FCE9A148286B5FEE850CB218CF485C;// 0x17E0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D0885F9A44AEAB93B13ABDA65B56635E;// 0x1820(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E0A64B5547D0D052F4A74F90039F20C9;// 0x1900(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DCE1C810433C8C02CD7EFF935968B75D;// 0x19D8(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3C0702954C627F9B8D9B79A995813F8B;// 0x1A20(0x00F8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3A20BE6E42D636910D69C6AC86915493;// 0x1B18(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C9455B72451FDD1FC9C47A851238ABEA;// 0x1C50(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1338E48046AC958D17276FB6A47B8751;// 0x1C90(0x0138)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_86466B83456D7139DB3D6DBDB90844B6;// 0x1DC8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_86287E2C475C2A7394C7E4926B059684;// 0x1E10(0x0040)
	class AOffice01_Freddy_C*                          FreddyActorReference;                                     // 0x1E50(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class AOffice_BaseGamemanager_C*                   OfficeManagerReference;                                   // 0x1E58(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    EyeRotation;                                              // 0x1E60(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Freddy_Office01_AnimBp.Freddy_Office01_AnimBp_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_EDDB609040CF1E5AA071469517D5D09D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_5E24C7614FA6F9C6F53F8A8DD3C57641();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_9C9E886843DE54D129603BAB7C61F42C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_404B12CD4C952F56EE8479AE96B4F37C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_580EF2844CEE33E833BF40A0BEFC626E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_586E1FDA450B57E87085199D36D01B52();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_A866127B4D3DA3CD9BE602A32B3F6063();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_317B05454CCEF9AB8B41298F21F0BAF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_C8D780744AA050804789D7BCE1AC5ECC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_2EEBF5F9429DD69F39C10FA7389379BA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_9F5BA2814D94BF1602A8CF97558970B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_EBFB78604D42FE99D9D126AC812ACD6B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TwoWayBlend_3C0702954C627F9B8D9B79A995813F8B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_ModifyBone_3A20BE6E42D636910D69C6AC86915493();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_ModifyBone_1338E48046AC958D17276FB6A47B8751();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Freddy_Office01_AnimBp_AnimGraphNode_TransitionResult_4D24FB9347076D7CD0C567A20A54BD35();
	void BlueprintBeginPlay();
	void AnimNotify_StartPowerOutageDeath();
	void ExecuteUbergraph_Freddy_Office01_AnimBp(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
