#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FunWithPlushtrap_ABP.FunWithPlushtrap_ABP_C
// 0x1B20 (0x1E80 - 0x0360)
class UFunWithPlushtrap_ABP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_769A776C401EE1BB9013719E8274C42B;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E6A24504107F8ACF300B58AA75D68CD;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_639D3CEC44BC66C07B6A68B81D402A07;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1E4530BD4E556114E978649AF961221D;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9596E6B44BE5EC9AB96A3A9B0219E848;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73331FCC4739130EE41E72938D84CE30;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B5E1EAC4AD6124BB131108468BC4105;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_311D77664B55044C434320A24DAF2D20;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CE4532564D86C320EC797A9559CAB907;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2447944C4A346572E5AF39AB95D84225;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B806FB604F7954601A1FF08BE623580D;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E4B257CB4C1DE097EB24ABBF6D01A95A;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A67C7B93481A5A9EAF8E6AB8DAFB9C89;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F004EA224AB424732BCA8EB24132E65B;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1B2A82734A47CFA28E3979B28DB04DE2;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D894E72C48E3C7A8546240A18CFB71BF;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5418351F4B017D28EEE9ABBA13745F67;// 0x07E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_551F224C451806F9327452B59ABD7C2E;// 0x0828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_234A97D74AB05A40EAC072AD67609BBC;// 0x0870(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7C028E8B4C4253FE2E9F0AB3FDE0BA47;// 0x08B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_733358AA4E1D6249C4A0AFA85D790B25;// 0x0900(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EEB36A34B6C640C653FBB8BBD7A257C;// 0x0948(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DF4CAD724108B1DCD751949C6CC3CFCE;// 0x0990(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30F02C8D4C30EFDB389EDBBD6CCBE37C;// 0x09D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8887B23B4801E67A54F46CA28A5FA33F;// 0x0A20(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_45A81E4F4A5DD0DD81F840B0266F02C1;// 0x0AC0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82B3ACD04CFF21B10C68D99950EE3863;// 0x0B00(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_60E91D944FD8E9D0D1CA5681C6D223E1;// 0x0BA0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41DCD2D943B9092D9CF92EBD751FA289;// 0x0BE0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_53A9E4E44942DDC6B0264886817D291D;// 0x0C80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5EF2305841AF95A3B45E08B7BF0E4712;// 0x0CC0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_88394CB0498FD7E5F25DA8A393B878E3;// 0x0D60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C29648B94AC5DB15517EA2ACE35970AC;// 0x0DA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CD71AE854CBC034AE1B204AB4D9B9B14;// 0x0E40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA9EA21F4FEED9F3F56B1284FF5B2AA2;// 0x0E80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_682A65E74036C0121D0D2593A12FDF75;// 0x0F20(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7DD0D125461A2F711DFAEF89F2FE914E;// 0x0F60(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BB3214BE4AA651CC425CC882CF7C382F;// 0x1000(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_36B0AA8846D1C04A6C790DAAB1F7E2AA;// 0x1040(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_543F70454CE171C0663B2CA9AC0A4649;// 0x10E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F05B7124F634222CD1B599EDCFDF2C6;// 0x1120(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0D8B05ED476F842CE6F20497F7E72BC7;// 0x11C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EE886A4644478AB18A526780D4987486;// 0x1200(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_22A8D7B34F523750E4EDD093974900BA;// 0x12A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A7BFD3CA496C645D7A67558D00053137;// 0x12E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A74F786049E32302E29DB18198962F10;// 0x1380(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_43DCDF2D46A01782DBF1B09CDEECDA74;// 0x13C0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_909D801A4E419BE067A22CA1F6C4D1F9;// 0x1460(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_019D2A314130974C771D8E814683A1C1;// 0x14A0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_254BB8E84CBEC9566A6FBEA464D753A4;// 0x1540(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_579812CE4AB9D0953B0168A28FD5C65B;// 0x1580(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0FAF8FD34E9996531A5A0DA3184AB1BD;// 0x1620(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3514494949341E65E56464A0B2867190;// 0x1660(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C0E384DD451796BD4CEF0C9A26CC6941;// 0x1700(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_90F4FB8D46BA40DD762FA89C133D26F7;// 0x1740(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5C5ED99C4A5D0AABE0944FB9A4AC2564;// 0x17E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7CF5F6EC4E2F46E3F48FCB945652396B;// 0x1820(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D83CC43F4BA585A773DA9CBAD2E87CE7;// 0x18C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_40B2375746FEE4166A7BBCA63860F63C;// 0x1900(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_BC53ACC54164B6E9D7F44EAC46B25D19;// 0x19A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B83162184652F216EFDDFE91760950F2;// 0x19E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7670BB974833F57963F7C4A549208F17;// 0x1A80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9AE463B14C605365088C00887F1BCFD6;// 0x1AC0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CA8BBDC74214EB3CD20FBD841F0E5A3D;// 0x1B60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_003E52CA40C8C95AA8F1A0A2DA0768F7;// 0x1BA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1E686BE44B89A12FFFCA2183D3CF149A;// 0x1C40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_04F5E6744FD3F44CC7E7F9922FDBF47E;// 0x1C80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0FBA49FD48219BCD7F0D6A977761E438;// 0x1D20(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_E1BE00A545B5F86B4116ECB6C1E2AA32;// 0x1D60(0x00E0)
	class UPlushTrapState_C*                           PlushTrapChanged;                                         // 0x1E40(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ChooseDirection;                                          // 0x1E48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x1E4C(0x0004) MISSED OFFSET
	struct FTimerHandle                                TimerHandle;                                              // 0x1E50(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CurrentAnimSeq;                                           // 0x1E58(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               NextAnimSeq;                                              // 0x1E60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsOnX;                                                    // 0x1E68(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayerWon;                                                // 0x1E69(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x1E6A(0x0002) MISSED OFFSET
	float                                              SetMinTime;                                               // 0x1E6C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SetMaxTime;                                               // 0x1E70(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TransitionPlayRate;                                       // 0x1E74(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TransDelay;                                               // 0x1E78(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Animation_Start_Position;                                 // 0x1E7C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass FunWithPlushtrap_ABP.FunWithPlushtrap_ABP_C");
		return ptr;
	}


	void ChangeStateToIdle();
	void ResetTimer();
	void ChangeStateToMove();
	void Fun_With_Plush_Trap_BP_Ref(class AFun_With_PlushTrap_BP_C** Fun_with_PlushTrap_BP_Ref);
	void ProcessMoveState();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_234A97D74AB05A40EAC072AD67609BBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_7C028E8B4C4253FE2E9F0AB3FDE0BA47();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_733358AA4E1D6249C4A0AFA85D790B25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_8EEB36A34B6C640C653FBB8BBD7A257C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_B806FB604F7954601A1FF08BE623580D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_DF4CAD724108B1DCD751949C6CC3CFCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_30F02C8D4C30EFDB389EDBBD6CCBE37C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_2447944C4A346572E5AF39AB95D84225();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_CE4532564D86C320EC797A9559CAB907();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_E4B257CB4C1DE097EB24ABBF6D01A95A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_551F224C451806F9327452B59ABD7C2E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_311D77664B55044C434320A24DAF2D20();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_1B5E1EAC4AD6124BB131108468BC4105();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_73331FCC4739130EE41E72938D84CE30();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_5418351F4B017D28EEE9ABBA13745F67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_9596E6B44BE5EC9AB96A3A9B0219E848();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_1E4530BD4E556114E978649AF961221D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_639D3CEC44BC66C07B6A68B81D402A07();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_D894E72C48E3C7A8546240A18CFB71BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_1E6A24504107F8ACF300B58AA75D68CD();
	void AnimNotify_Idle_Chair();
	void AnimNotify_Idle_Back();
	void AnimNotify_PT_Idle_BLD();
	void AnimNotify_PT_Idle_BRD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_1B2A82734A47CFA28E3979B28DB04DE2();
	void AnimNotify_PT_Idle_Mid();
	void AnimNotify_PT_Invis_2();
	void AnimNotify_PT_Invis_3();
	void AnimNotify_PT_Idle_FRD();
	void AnimNotify_PT_Idle_FLD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_A67C7B93481A5A9EAF8E6AB8DAFB9C89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithPlushtrap_ABP_AnimGraphNode_TransitionResult_F004EA224AB424732BCA8EB24132E65B();
	void AnimNotify_PlayerKilled();
	void AnimNotify_Invis();
	void AnimNotify_Idle_BLD();
	void AnimNotify_Idle_BRD();
	void AnimNotify_Idle_Mid();
	void AnimNotify_Invis2();
	void AnimNotify_Idle_FLD();
	void AnimNotify_Idle_FRD();
	void AnimNotify_Idle_OnX();
	void OnPlushTrapStateChanged(class UPlushTrapState_C* PlushTrapState);
	void StartIdleTimer();
	void Initialize();
	void ExecuteUbergraph_FunWithPlushtrap_ABP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
