#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BigToy_Office04_AnimBP.BigToy_Office04_AnimBP_C
// 0x1BA2 (0x1F02 - 0x0360)
class UBigToy_Office04_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_7EBA74ED424D59736A5F2A80D637C1B0;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8EE790FC499D7231E852989FBC334DB6;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E6EA2D2E4DD732A0F412BC93F9B6EAA3;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2FEDD5B045410CC6DA478D904725F9B0;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AFF180974B615F0737BD038AE9A151CD;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CDA85A6640CE6EAA05C4C98FBB53CA5F;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D0258FE41FD8184F6386AB8EEB2C3D3;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_637F9C904B7F7BD18D1548BA86EBAF9D;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8943F2F143D30611A6B8F69246C40DA1;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03B30CAB4717841A289CB789D6AC83D4;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E15FF61F4B19BB90C3AF269C54774621;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD6076FB491692930CDAA594628E3F39;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A8AF184A45CBDE1776F69F8F3B607BD2;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82DECDB6466D7FC81BF36594C2E2256E;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B3F9D5AF4C034654309CDABE7271F1A2;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB9A8EBE4A2152FBD5BA5881E8DCBAB6;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0B6D0EA24933C5149882FBB9DB2491B6;// 0x07E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5AB4118A46DA685C2C7B6788E7D7AD29;// 0x0828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C42A50C450CDF0BF30131A495031B7E;// 0x0870(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42DCBF3A480AF0B105AE83984C6B39DB;// 0x08B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FE84360C4CEECB50D1D0A89B1A1CDB90;// 0x0900(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_924E44C742CDA57C00D7738CE35CD82D;// 0x0948(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8A8873564DD329F5CA26DBB089072334;// 0x0990(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77037A8340B63519C1081596C26FC702;// 0x09D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2BAE136E470BA409711F2A92AFD18186;// 0x0A20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63EE5F1C43F3D6805C8CBAA833F22F08;// 0x0A68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44CF4A5342F80EB596874F96AB2138A0;// 0x0AB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B71760764A4C898D78A2B3B8A7AC1E62;// 0x0AF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B91AE7942158F030EDD64AE507B202C;// 0x0B40(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E844959A45D45F0618318297A519D27D;// 0x0B88(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A2A3AAA2416D8172831DF09CC439B56D;// 0x0C28(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC63E8B748D57B5376128BAAAD5E155B;// 0x0C68(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6B194EE74D54DEC66B4806B4EE85EF4C;// 0x0D08(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_46AD26A547E7C8E60BBFC2AB4ADC4583;// 0x0D48(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C3BEC2F240D98EE342FCBD8F1F5690E7;// 0x0DE8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_536A56694B9E54DE7F796788D2E94287;// 0x0E28(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_06588F14469AD171C54107AEA2E6938E;// 0x0EC8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_097388D84F81F38A704F17A1FCED1B84;// 0x0F08(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FEC4678A4FDF4E90992A5FB294738E7A;// 0x0FA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9BD797D54B07ED3C814705A909916670;// 0x0FE8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B7E4EFBF459D5EF992203189C8BFC203;// 0x1088(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62F9B0564984D6D03AF81F8AEE398B9F;// 0x10C8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D0CA0BAF45161B2779E215B71301F9BB;// 0x1168(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_273D55FE4A2212F2D2F2C481FD960549;// 0x11A8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_39029B1D49A4C3EF9DF286A09D4B0DA3;// 0x1248(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FBB8D521407515510852B5AB14AC27FB;// 0x1288(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C249507B4EC4BD3B533D968408C252B9;// 0x1328(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D1B78146463B91E9E7A62BB734DF26B8;// 0x1368(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_36BC23F5487CA01502DA7C84BD3211FF;// 0x1408(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3F7F0B10495CB3426EF9A0AFFF39AA43;// 0x1448(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_72ACF7B448A104674984E9B482FDA23D;// 0x14E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D71C002443C04AD6471167A23FB17CC0;// 0x1528(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A322A3894D542F0619DFFDAA00033BDF;// 0x15C8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0B98648E45B88C6AFDA00F8D43CD95B7;// 0x1608(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E3F228CB49E67BE3EEE7C38E1DBE0472;// 0x16A8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8C941F5347C0D376C1D7139D67BDCCD6;// 0x16E8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_41035E0340FEBFADB3C80E848C4A1613;// 0x1788(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FD2BDE4B4FD27BBD0BD7899F551C2BC5;// 0x17C8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_17EDCF0E4A2469474CE70CAFADACBE1D;// 0x1868(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3F485B084CF5C2D4EAF1F3ABFE68FE0F;// 0x18A8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2274260F4960FDE9B755CEBE6915BDF2;// 0x1948(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C39EB7A44942E0E45A9996B9B0B2DBB6;// 0x1988(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_19DE333943E196296214A3A0008ECEDB;// 0x1A28(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BCA3001F4282BA253F6077B79DC44300;// 0x1A68(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AC3E45F944F53973E6914EB9761DECCD;// 0x1B08(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_06EEC8D54D88B0A5C657218957CF6D2D;// 0x1B48(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_71635BDC4FACE0CF45F82AB1751E8B5F;// 0x1BE8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D80C5FF54DA7A2370FF50BB0D910FD7E;// 0x1C28(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B3EEBB924EC27AA79251259361FA122F;// 0x1CC8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A2ADEC294C0C52ADEC88168AC798B4DF;// 0x1D08(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9A50CF0D4CAC29984D695593CC150585;// 0x1DA8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BC1AD00B4459D96899BCEDBC22D346A9;// 0x1DE8(0x00E0)
	class UAnimSequence*                               CurrentAnimSeq;                                           // 0x1EC8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               NextAnimSeq;                                              // 0x1ED0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SetMinTime;                                               // 0x1ED8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SetMaxTime;                                               // 0x1EDC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FTimerHandle                                TimerHandle;                                              // 0x1EE0(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UBigToy_O4_State_C*                          BigToyChanged;                                            // 0x1EE8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ChooseDirection;                                          // 0x1EF0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsAtLeftDoor;                                             // 0x1EF4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsAtADoor;                                                // 0x1EF5(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LeftDoorIsClosed;                                         // 0x1EF6(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               RightDoorIsClosed;                                        // 0x1EF7(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsFlashed;                                                // 0x1EF8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WaitingAtADoor;                                           // 0x1EF9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Activate;                                                 // 0x1EFA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x1EFB(0x0001) MISSED OFFSET
	float                                              WaitTimer;                                                // 0x1EFC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LeaveDoor;                                                // 0x1F00(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayerWonGame;                                            // 0x1F01(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass BigToy_Office04_AnimBP.BigToy_Office04_AnimBP_C");
		return ptr;
	}


	void PlaySFX_FootFalls();
	void GetRightDoorState();
	void ProcessMoveState();
	void Big_Toy_BP_Ref(class ABigToy_Office04_BP_C** Big_Toy_BP_Ref);
	void ChangeStateToMove();
	void ChooseNextAnimation();
	void ResetTimer();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_8943F2F143D30611A6B8F69246C40DA1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_03B30CAB4717841A289CB789D6AC83D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_E15FF61F4B19BB90C3AF269C54774621();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_CD6076FB491692930CDAA594628E3F39();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_637F9C904B7F7BD18D1548BA86EBAF9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_B3F9D5AF4C034654309CDABE7271F1A2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_0B6D0EA24933C5149882FBB9DB2491B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_5AB4118A46DA685C2C7B6788E7D7AD29();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_FE84360C4CEECB50D1D0A89B1A1CDB90();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_924E44C742CDA57C00D7738CE35CD82D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_77037A8340B63519C1081596C26FC702();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_2BAE136E470BA409711F2A92AFD18186();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_63EE5F1C43F3D6805C8CBAA833F22F08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_B71760764A4C898D78A2B3B8A7AC1E62();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_CDA85A6640CE6EAA05C4C98FBB53CA5F();
	void AnimNotify_04_Idle_Start();
	void AnimNotify_04_Idle_RH01();
	void AnimNotify_04_Idle_RH03();
	void AnimNotify_Trigger_KILL();
	void AnimNotify_ResetToStart();
	void AnimNotify_04_idle_LH01();
	void AnimNotify_04_Idle_LH03();
	void AnimNotify_04_StartSequence();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BigToy_Office04_AnimBP_AnimGraphNode_TransitionResult_AFF180974B615F0737BD038AE9A151CD();
	void BlueprintBeginPlay();
	void StartIdleTimer();
	void BigToyStateChanged(class UBigToy_O4_State_C* BigBoyState);
	void ExecuteUbergraph_BigToy_Office04_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
