#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Bonnie_Office01_AnimBp.Bonnie_Office01_AnimBp_C
// 0x22AC (0x260C - 0x0360)
class UBonnie_Office01_AnimBp_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_86FCC22D47CF610CA11C1AA555AB0603;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_53CEDC26414CB0B1FA39C59AFC8C3FAB;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18A00E7A452712E7B1E147BD5C56BC3D;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_875471264B6CBC89E9E66F8966328363;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A738866B4FEFE8E89208C7A9BB9B8E3C;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860B42344BE9465AD6C419802131EF48;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A5CCBDF748EE8BEEBBBD23AE415A1DD7;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E1747E674AF03FC771CF52A40619D6AC;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6F1F84348E83602D9343F866B36867F;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C53565049399F2394313A8D32DA2255;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_831ADA5B4D531E3FAB9F63BE7E75AAEA;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5B06716942CCBE2451A162AED028C29C;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3526029441986820EEBEA993DAD33A31;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C974623C4767BA5488609BA93D77E160;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3FB70B6D477A58745EB5D0B6CCD08227;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_062C07D744E069887CE161855B98A641;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A511631940010395A4C712BB19AF868E;// 0x07E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81D8B59B484C73FA7F73B0AB17FBC584;// 0x0828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6C2D8E1540AE0520EF2937A41BE02D17;// 0x0870(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2F935EFB4C04A3E05D67A7909260393D;// 0x08B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2DFF3ED24AE910CDEDE83998F7673E9C;// 0x0900(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7016C26F411411B54347238B321DEB61;// 0x0948(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E788476940099EDEC3ECE6993EF8DFF9;// 0x0990(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EC042AD148D253EC1D62AFA3ED46A6CE;// 0x09D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F0D97564648A5E76DF131B30B9836F6;// 0x0A20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_95527AD4420F4B1AE96179A474F09A16;// 0x0A68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D93E30F64F80731384A027942EACD93A;// 0x0AB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_224FEE45478A23385DD2CFA3A7FDAF92;// 0x0AF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_76F94DD0457FC951E0BFCB8E35CFB5A1;// 0x0B40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FECE852043A340BBCFCF6EA7423586A6;// 0x0B88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A11FDF940BAAD5E38A985AD4EDC6FE6;// 0x0BD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_51DF3800484AAC2ADE318FB7DAB72A2F;// 0x0C18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69DBC86E43805212A5565DAFF20A2F2C;// 0x0C60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7175D4EB413859B24B7A63937C2F100E;// 0x0CA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_452BE3CB483407EAB8577AB6A5097DCA;// 0x0CF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E426BB4E44550DD82F6AB0877A4EB635;// 0x0D38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B4B0E92940AEAE3B966E48822AE5DA4D;// 0x0D80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_01580F3D4A5399B288C9B0AA00263E46;// 0x0DC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_81DC4CE2469D2B77DE2D9CB3FE0002C9;// 0x0E10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43E19B6649E24F108131CC9309F742C8;// 0x0E58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_400E6D6646D28769157BA59E166BAE37;// 0x0EA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0CCA5E7E447330EA3A6A539DFE8FEDBC;// 0x0EE8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B656B76241AEA4A33BCADDB6170E62C0;// 0x0F30(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0CA5BE4C4254E07C35A817A9DDAE4790;// 0x0F78(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5C2A342D4F1C5A08B27019B6FBDAFE01;// 0x1018(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A6BAC1004AD201D0C18DA08722C1BC17;// 0x1058(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D253DC02408A77981E3F7C896FBF5789;// 0x10F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_162246194C635CF278337E95FE1892DF;// 0x1138(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_176B828B4D4F7367254D26A10606890A;// 0x11D8(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_AF83FF7C4AC414A0FB6AB9B96EC61FEC;// 0x1218(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E1383C15463899A5A2E0639C8B7B805E;// 0x1258(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_329C448C4D5DB40710BD0FBADE950DB2;// 0x1298(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_66E788BA4E64C9D1B36AF5AFB0C7A904;// 0x13D0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0A4EA23B4419BAEE9AEEDF964C18507C;// 0x1470(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B9D5EEA943E3F67414C41BBE3261C356;// 0x14B0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A2D6C02046B5189B0495EDBCDF2383C9;// 0x1550(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2BFAE62748A1EA6D70B72AB6C0892B98;// 0x1590(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8DCDC4B1405063337868A8AADCC94B70;// 0x15D0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8ACC95544702E466F305D5A878BF247A;// 0x1610(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4E58699942C9D2DDCF025B907A444C8D;// 0x1748(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E2F5F9C247D1E6AAC18D059B980348D4;// 0x17E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B454BA4B4EA3D820B253FF9F5337CDC7;// 0x1828(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_ED2E92CB4B93DDA0234AE3BD458450D1;// 0x18C8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8129B8F14F77BB0D07C954AD4F83FE80;// 0x1908(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E195166745E411BFBB89EABF3C06D242;// 0x19A8(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8A698D72477398C632D309B1CB9547BE;// 0x19E8(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4AD1701D400C5F2427B977AC1F2AB525;// 0x1A28(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2AE3443C49092E27A33A86BA2A2F94B2;// 0x1A68(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01C63CC44A2DB3AC18AEDF9FD075B6A3;// 0x1BA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_76DE28354E7CB36FF1530585336C8C0B;// 0x1C40(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4122511342AF4622921956BCDE8EE43E;// 0x1C80(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B1CD07CE48945A8D3AF27CA74C8E9D6E;// 0x1CC0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DB963ECF4A58B6BD6D3572A9A1A358F9;// 0x1D00(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DCB37BEF4E8F5863B97A53B5AFD41602;// 0x1E38(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_315DDEC440656156F4771694544E5B29;// 0x1ED8(0x0040)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_805D2DC34139C397FDF4E4BD3CDAB77F;// 0x1F18(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7687B71B493B5183D707968C55619F95;// 0x1FA8(0x0040)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_28B5905C4E8DAAA2613CEF8EC4A0CD2F;// 0x1FE8(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_667B7B914C5335C7AF79A48CE67DE1EE;// 0x2078(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56B6484741ED0C028300BD95A8335BEF;// 0x20B8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_82A49BB44893336B7C7715B165F996DB;// 0x2158(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E355E7B94AFEBDD2A425EEB24EA8FFB6;// 0x2198(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A074F24A484351F75004E8A563932410;// 0x2238(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CA5C8D4D4C8A9C9EE40410950A128C6D;// 0x2278(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F3099676430ACE5FAF4ED0859FBD9BB5;// 0x2318(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F31C8C484C3044F8BA4A569B3C490198;// 0x2358(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_52250594405BAE74E72E328CB6F00C40;// 0x23F8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4C3DB27A43BBD1B5D000DBBD10F5029B;// 0x2438(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3D5A8C10430A61CA9F479793FAEECB80;// 0x24D8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DAE8F62C4C4194816E50FF87D16E8C7E;// 0x2518(0x00E0)
	class AOffice_BaseGamemanager_C*                   OfficeManagerReference;                                   // 0x25F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class AOfficeAiBase_Bp_C*                          BonnieActorReference;                                     // 0x2600(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	bool                                               DoorLightIsOn;                                            // 0x2608(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HallwayWalkCompleted;                                     // 0x2609(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HallwaySecondWalkCompleted;                               // 0x260A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               GlitchNotify;                                             // 0x260B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Bonnie_Office01_AnimBp.Bonnie_Office01_AnimBp_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_53CEDC26414CB0B1FA39C59AFC8C3FAB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_18A00E7A452712E7B1E147BD5C56BC3D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_875471264B6CBC89E9E66F8966328363();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_A738866B4FEFE8E89208C7A9BB9B8E3C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_A5CCBDF748EE8BEEBBBD23AE415A1DD7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_E1747E674AF03FC771CF52A40619D6AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_C6F1F84348E83602D9343F866B36867F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_2C53565049399F2394313A8D32DA2255();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_831ADA5B4D531E3FAB9F63BE7E75AAEA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_5B06716942CCBE2451A162AED028C29C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_3526029441986820EEBEA993DAD33A31();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_C974623C4767BA5488609BA93D77E160();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_3FB70B6D477A58745EB5D0B6CCD08227();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_062C07D744E069887CE161855B98A641();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_A511631940010395A4C712BB19AF868E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_81D8B59B484C73FA7F73B0AB17FBC584();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_6C2D8E1540AE0520EF2937A41BE02D17();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_2F935EFB4C04A3E05D67A7909260393D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_2DFF3ED24AE910CDEDE83998F7673E9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_7016C26F411411B54347238B321DEB61();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_E788476940099EDEC3ECE6993EF8DFF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_EC042AD148D253EC1D62AFA3ED46A6CE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_9F0D97564648A5E76DF131B30B9836F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_95527AD4420F4B1AE96179A474F09A16();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_D93E30F64F80731384A027942EACD93A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_224FEE45478A23385DD2CFA3A7FDAF92();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_76F94DD0457FC951E0BFCB8E35CFB5A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_FECE852043A340BBCFCF6EA7423586A6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_4A11FDF940BAAD5E38A985AD4EDC6FE6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_51DF3800484AAC2ADE318FB7DAB72A2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_69DBC86E43805212A5565DAFF20A2F2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_7175D4EB413859B24B7A63937C2F100E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_452BE3CB483407EAB8577AB6A5097DCA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_E426BB4E44550DD82F6AB0877A4EB635();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_B4B0E92940AEAE3B966E48822AE5DA4D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_01580F3D4A5399B288C9B0AA00263E46();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_81DC4CE2469D2B77DE2D9CB3FE0002C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_43E19B6649E24F108131CC9309F742C8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_400E6D6646D28769157BA59E166BAE37();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_0CCA5E7E447330EA3A6A539DFE8FEDBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Bonnie_Office01_AnimBp_AnimGraphNode_TransitionResult_B656B76241AEA4A33BCADDB6170E62C0();
	void BlueprintBeginPlay();
	void AnimNotify_StartStatic();
	void AnimNotify_Bonnie_JumpScare();
	void AnimNotify_CheckForDoorLight();
	void AnimNotify_HallwayLook();
	void AnimNotify_HallWayWalk();
	void AnimNotify_CompletedSecondHallway();
	void AnimNotify_ResetBool();
	void AnimNotify_NM_GlitchNotify();
	void AnimNotify_NM_ResetNotify();
	void AnimNotify_ForceLightFlicker();
	void ExecuteUbergraph_Bonnie_Office01_AnimBp(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
