#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Chica_Office01_AnimBp.Chica_Office01_AnimBp_C
// 0x1FBD (0x231D - 0x0360)
class UChica_Office01_AnimBp_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_167D47104660E9FFDF213AA40B8A6CAF;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36246EDD41B7ACF06326248DD583EE0C;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_07B2447C40EA84B9AFC63C8013E2D29D;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41F03EC74131A2DA7640ACA3406CDFF8;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8304573240297B6D018425ACA214041B;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_111DC51240E9A5EE383D3AAEA5297856;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7052DBDB47646B38A68ED3B59514BEBD;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9F818FBB47D0D302D51712838AB3517B;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE32AFFE4D7DC60E17170F9C97A0F0C9;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD9FB7A740CF68286653F483C6052033;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8C150F764CEB6F3B1429EE90B5257E64;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_860EAA554E71571AF92228A413ED8079;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7AA666F248915CA1C4CEF99F2B9F1998;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B11190F042B2F47EC2223A8237DB00C7;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62058EAD49FEC795EB4BA5A8DE2E9146;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E37815C741A15B83A757E7856EF1D658;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B60ECF804FFA63F4EC46B7A8B84F1CFA;// 0x07E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A4426D341A13CE90231678F2A75E049;// 0x0828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FC96694745B9418F264803BE05186E09;// 0x0870(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_241DCEFD443246B31A73FB9B04E965B0;// 0x08B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD6F1416498399271AC7858AD77657AC;// 0x0900(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_96B37B0944044ACF5CB91984ACDB68F0;// 0x0948(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3CBA8971401D0E5ABD6C65A04295BA8E;// 0x0990(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB78CF39437CC85F80E950AA06970BBC;// 0x09D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43FF6DD34503D689BEBA34986FDB73F1;// 0x0A20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D69AB19A4E31E72161FCC1A9FBCD6733;// 0x0A68(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4C3000D4DF71B011E4FA097C3B71E3A;// 0x0AB0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_736D18054B230BF3C9802BB3EFE40187;// 0x0AF8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F0787B16498765CBFDA2A4B9C46AC54C;// 0x0B40(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0745D04B4CFFA0BE41A182ADEC957BF2;// 0x0B88(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B8A2107471B5E1D85A2B49DE1A6BD1F;// 0x0BD0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DCDCC9D409464C9563141B05CB60BDB;// 0x0C18(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0EC775094E019B8E9DB4719CB5C837C7;// 0x0C60(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_79CBC2FD4675E2F7A50CE5B65DE315C0;// 0x0CA8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_723E98D140A0B207EB78C1AA515D742C;// 0x0CF0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_687B7DCB4D3F62229327A9B951783BED;// 0x0D38(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0710A16248AEDF531F67A9943F14FAD4;// 0x0D80(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A4D23B4143CC9F756E8738A723A4D606;// 0x0DC8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A6EC6C1940F06A2257E499947AF177F9;// 0x0E10(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_65C3AFC94939584356970687FB8590A4;// 0x0E58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_118BCC37462F09393C4E5C852EE3094C;// 0x0EA0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_542E786E491B2C22C34441BAA25725B5;// 0x0EE8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_61454B7C4CECDCF2197D27BDCF101927;// 0x0F30(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A0A54E5F48FD9B064C49A09CF10F6D6D;// 0x0FD0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2D890295410ACBA8C6F3A0A46C4C0619;// 0x1010(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CA91A42C487BDBF7F5B67E86845EB9C4;// 0x10B0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_63E356FE446D4B1A9B43199E5DF095EA;// 0x10F0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6C73947F49CFEBF9529B77AEBD8A6CF4;// 0x1190(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C91211374C1EA370EE3AC08585678987;// 0x11D0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D1307216440D78D7290B4D9E1BC0D70E;// 0x1270(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4CD477594EFBEA6FA0D7EA8244FFC2DE;// 0x12B0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F5B3822E4C8BC06D6121D2A002D96D1B;// 0x12F0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_80DEEBD2400E81216C1F958F40D69F65;// 0x1330(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C41E54C4EB45798FDCE869916B20E48;// 0x1468(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FE98A1C84E47D1B4C63C5CA73559FEF6;// 0x1508(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3C4E93D8420C24F2DB680CA429E76C5A;// 0x1548(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1C1A4AEC4E1BA14712A658A10E9CD181;// 0x1588(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_22200F3F458042B032E31EA70C6C1C9A;// 0x15C8(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1B0D72CE41610C8FCA089B9F01F1BC64;// 0x1700(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FF5DBF9640D0A95E8DD6348CEEE3F716;// 0x17A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4BC1DB39442625FBBC4CA88F56C6D0D5;// 0x17E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_52A246504E5ED6EFAA5359A8465E089C;// 0x1880(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7F7075FF453F447F928C259C7A288B02;// 0x18C0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_73F48D854B8E555EE95FB4BC95039470;// 0x1960(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_25C1E127461D2CFAA9B6D0AFF85C0D00;// 0x19A0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E824A0064D50B24BC76234A78EFB45BA;// 0x1A40(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_275017A84057B5090DA0058A634A309A;// 0x1A80(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E3FA314F4E06BDBA17ED0EBE53ABF373;// 0x1AC0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5429B6744EB4E9E1216CF2B2297796C9;// 0x1B00(0x0138)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_8E3C2FF245D98730A356579139D1B04B;// 0x1C38(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2C7E51164D5AD6505ED0CA86ADAC652F;// 0x1CC8(0x0040)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_B57A28E848B3D847E9AC31B12C8B193F;// 0x1D08(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5BDE021E4858DB125A5FCFA1674F1518;// 0x1D98(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F8894997448E45F7186A8786E1B9F703;// 0x1DD8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C2D1D6B0449E9FC885FF6BB0A729E249;// 0x1E78(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_48E716C0442041623E1F1DB45764405C;// 0x1EB8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1FAAECC44C4ABD7B44D60F83F74E6B3C;// 0x1F58(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E827680349CE764DCE0268B71B63F29A;// 0x1F98(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_98ECB31F462FFBE06E274983A3D1ABE9;// 0x2038(0x0040)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_3688F59749748D69001EB3BFCE4DA943;// 0x2078(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3EB3B19C453413BE8269208E021308C5;// 0x2108(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_51ACB3AF459148A9B09BDE9F0C0582D5;// 0x2148(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1E310638440E08ADE6DBDEBFE1DD97A8;// 0x21E8(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_0E4CBF2A492151975AC908AE7D2F9DAD;// 0x2228(0x00E0)
	class AOfficeAiBase_Bp_C*                          ChicaActorReference;                                      // 0x2308(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class AOffice_BaseGamemanager_C*                   OfficeManagerReference;                                   // 0x2310(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	bool                                               DoorLightIsOn;                                            // 0x2318(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HallwayWalkCompleted;                                     // 0x2319(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HallwaySecondWalkCompleted;                               // 0x231A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               NewVar_1;                                                 // 0x231B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               GlitchNotify;                                             // 0x231C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Chica_Office01_AnimBp.Chica_Office01_AnimBp_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_36246EDD41B7ACF06326248DD583EE0C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_07B2447C40EA84B9AFC63C8013E2D29D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_41F03EC74131A2DA7640ACA3406CDFF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_8304573240297B6D018425ACA214041B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_7052DBDB47646B38A68ED3B59514BEBD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_9F818FBB47D0D302D51712838AB3517B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_EE32AFFE4D7DC60E17170F9C97A0F0C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_CD9FB7A740CF68286653F483C6052033();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_8C150F764CEB6F3B1429EE90B5257E64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_860EAA554E71571AF92228A413ED8079();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_7AA666F248915CA1C4CEF99F2B9F1998();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_B11190F042B2F47EC2223A8237DB00C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_62058EAD49FEC795EB4BA5A8DE2E9146();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_E37815C741A15B83A757E7856EF1D658();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_B60ECF804FFA63F4EC46B7A8B84F1CFA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_0A4426D341A13CE90231678F2A75E049();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_FC96694745B9418F264803BE05186E09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_241DCEFD443246B31A73FB9B04E965B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_CD6F1416498399271AC7858AD77657AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_96B37B0944044ACF5CB91984ACDB68F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_3CBA8971401D0E5ABD6C65A04295BA8E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_DB78CF39437CC85F80E950AA06970BBC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_43FF6DD34503D689BEBA34986FDB73F1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_D69AB19A4E31E72161FCC1A9FBCD6733();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_C4C3000D4DF71B011E4FA097C3B71E3A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_736D18054B230BF3C9802BB3EFE40187();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_F0787B16498765CBFDA2A4B9C46AC54C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_0745D04B4CFFA0BE41A182ADEC957BF2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_3B8A2107471B5E1D85A2B49DE1A6BD1F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_7DCDCC9D409464C9563141B05CB60BDB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_0EC775094E019B8E9DB4719CB5C837C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_79CBC2FD4675E2F7A50CE5B65DE315C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_723E98D140A0B207EB78C1AA515D742C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_687B7DCB4D3F62229327A9B951783BED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_0710A16248AEDF531F67A9943F14FAD4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_A4D23B4143CC9F756E8738A723A4D606();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_A6EC6C1940F06A2257E499947AF177F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_65C3AFC94939584356970687FB8590A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_118BCC37462F09393C4E5C852EE3094C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Chica_Office01_AnimBp_AnimGraphNode_TransitionResult_542E786E491B2C22C34441BAA25725B5();
	void BlueprintBeginPlay();
	void AnimNotify_StartStatic();
	void AnimNotify_ChicaJumpScare();
	void AnimNotify_CheckForDoorLight();
	void AnimNotify_HallwayLook();
	void AnimNotify_HallWayWalk();
	void AnimNotify_CompletedHallwayWalk();
	void AnimNotify_ResetBools();
	void AnimNotify_CheckForFreddy();
	void AnimNotify_NM_GlitchNotify();
	void AnimNotify_NM_ResetNotify();
	void AnimNotify_ForceLightFlicker();
	void ExecuteUbergraph_Chica_Office01_AnimBp(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
