#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Fun_With_PlushTrap_Anim_BP.Fun_With_PlushTrap_Anim_BP_C
// 0x1B34 (0x1E94 - 0x0360)
class UFun_With_PlushTrap_Anim_BP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_0D923EDE4D54A74C02CFDD81F85F8FED;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7907F424440EDADB90EC71A9D0439840;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B552F3DC4B4D9CA380E05F85AD481DCC;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1DEFF24F49520C0A8C38469F40F6CB7C;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_534D540D489E506F51E249BF42582BDC;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02989EA845F3412E5DB6758FC2C5ED12;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DA80C2448EDC910962757960685D977;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F22C114E41FECC22FB94E8BF7C274E11;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C419E514185366E22C03D9065C65F02;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_698FDDE64ECE8106BB365B8A6671C00D;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2C6C5EEE42675F066ECDAB8F27D08B78;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2182A2C24302B691AAB0198A59F6A9FB;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1CCE0CE8417F73EF64D5FCA02021F8C8;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6928CF91428C809D6751FAB33649CBD6;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6F9FCC964C90CAE6FB4D2283C401F29E;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_357872A64228B70F0C77228EB5BFBA82;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E17005F449D3586312E80C8FBA3DF937;// 0x07E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ED65CFB541C5445458102DA35E13575A;// 0x0828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F031FB3B4A2871BE00D8B5A201969B19;// 0x0870(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7D6783CC4D5D297832BC8E975A8CA829;// 0x08B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9C7D3D2B4FF96CDFE7EFD3BC314D99E5;// 0x0900(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77608687413C878CC180E8920A223E11;// 0x0948(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9791BF5240A055AE6803198C05BAEC34;// 0x0990(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C209460F400AB186B4960BAB69A90788;// 0x09D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_544B7F934D3555BBC253529C68BBCFBF;// 0x0A20(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DD2822C24D214848CA434B8E507EF9CF;// 0x0AC0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2006637B48FAEC2D3DD5B887D98924ED;// 0x0B00(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4282C31C455FB363539C5E9EB33E32E6;// 0x0BA0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C28D0D9483A21FB646C27B3EA2AEDDC;// 0x0BE0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C44FF80B4DAB23A05940DE821ABC014A;// 0x0C80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_95162B9A4578253FC8D09894AA618011;// 0x0CC0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_044110624656D2E04231E5821A48646C;// 0x0D60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D0DA2B3E4F38B81E24804BA887E4DA70;// 0x0DA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_853FED454F90651405415DB226F6C0A5;// 0x0E40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5CD47F0D421D085126F481B07D39EC55;// 0x0E80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7319E7AB4C792EB3FAD43ABEAB9533E8;// 0x0F20(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4AE106424332B6E289C53BB66C195ED7;// 0x0F60(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C761C0314D406C13D451CBB18C0CA930;// 0x1000(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_913763FF4AD2C1199552B491F0890728;// 0x1040(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_204B97204C4971FE34EFA980D5233867;// 0x10E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_56979C99438B1979735D189C8EEB265A;// 0x1120(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_55795AB346FA45300B9A42A65664793A;// 0x11C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A1D7A054B6987548AF4E09AF6ABE5FC;// 0x1200(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A710AFB74BBC4AE4076E12B4C675ECCE;// 0x12A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D5E775A44DB066F094065C8B0EAF30FA;// 0x12E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D8CE48304FCD34497B14038652A12FEE;// 0x1380(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_254945FD4EE9EF7F8C264D9524F80F3D;// 0x13C0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_63EAC7134C6590AD6C8D939E30B19D25;// 0x1460(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2D7FB9904A75E71EF073A4949295DA94;// 0x14A0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1888F0E44D5C5873BABD68B00E578548;// 0x1540(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5F0321AA4E061E946E9F99A20E9E4C7D;// 0x1580(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7B0681C649BA43BD567237A218153431;// 0x1620(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DEECC9664C05AD58D2DBADAB0E9DF02C;// 0x1660(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5AC4614F4BE88F7EE56EC187FD90642A;// 0x1700(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3ED1701433D798AB3398F96FCC04D26;// 0x1740(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F767BEDB4385724A4BC825A16BA04749;// 0x17E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13E6007F41139747A5AF4BB8CA674C6A;// 0x1820(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_085674DE4C4AEB1A923A5DAB2EBC816F;// 0x18C0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_082F4A3F43551FC1A20C8FBD96EF1E95;// 0x1900(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D31C6896431E3EA619663996D55B170A;// 0x19A0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBF179F34DE7E35D2907CC922F3571EC;// 0x19E0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C41BD2424F086C8F338628AFB679F456;// 0x1A80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15B63A784D18F95F8ABF69BB5856A8F5;// 0x1AC0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_719BD38B49B8B931959A119827AB8CE5;// 0x1B60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_21C465004990707B5971F4A9E9D63B7D;// 0x1BA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6A8BF4E64DD049D774B41CB2E4299C7C;// 0x1C40(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CFF0A56D48B47CA2D876A68ED194D2FA;// 0x1C80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_036512BB43C880F1B5A604B45EE6B653;// 0x1D20(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_277AEA0E4A7287542AC83AA6C65FC031;// 0x1D60(0x00E0)
	class UPlushTrapState_C*                           PlushTrapChanged;                                         // 0x1E40(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ChooseDirection;                                          // 0x1E48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x1E4C(0x0004) MISSED OFFSET
	struct FTimerHandle                                TimerHandle;                                              // 0x1E50(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CurrentAnimSeq;                                           // 0x1E58(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               NextAnimSeq;                                              // 0x1E60(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    KillPlayer;                                               // 0x1E68(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    PlayerCanWin;                                             // 0x1E78(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	bool                                               IsOnX;                                                    // 0x1E88(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayerWon;                                                // 0x1E89(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x1E8A(0x0002) MISSED OFFSET
	float                                              SetMinTime;                                               // 0x1E8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SetMaxTime;                                               // 0x1E90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Fun_With_PlushTrap_Anim_BP.Fun_With_PlushTrap_Anim_BP_C");
		return ptr;
	}


	void ResetTimer();
	void ChangeStateToIdle();
	void Fun_With_Plush_Trap_BP_Ref(class AFun_With_PlushTrap_BP_C** Fun_with_PlushTrap_BP_Ref);
	void ChangeStateToMove();
	void ProcessIdleState();
	void ProcessKillState();
	void ProcessMoveState();
	void ChooseNextAnimation();
	void ChangeAnimationState(unsigned char AnimState);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_6F9FCC964C90CAE6FB4D2283C401F29E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_357872A64228B70F0C77228EB5BFBA82();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_E17005F449D3586312E80C8FBA3DF937();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_ED65CFB541C5445458102DA35E13575A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_698FDDE64ECE8106BB365B8A6671C00D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_F031FB3B4A2871BE00D8B5A201969B19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_7D6783CC4D5D297832BC8E975A8CA829();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_9C7D3D2B4FF96CDFE7EFD3BC314D99E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_77608687413C878CC180E8920A223E11();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_2C419E514185366E22C03D9065C65F02();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_9791BF5240A055AE6803198C05BAEC34();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_C209460F400AB186B4960BAB69A90788();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_F22C114E41FECC22FB94E8BF7C274E11();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_0DA80C2448EDC910962757960685D977();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_02989EA845F3412E5DB6758FC2C5ED12();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_534D540D489E506F51E249BF42582BDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_1DEFF24F49520C0A8C38469F40F6CB7C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_B552F3DC4B4D9CA380E05F85AD481DCC();
	void AnimNotify_Idle_Chair();
	void AnimNotify_Idle_Back();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_2C6C5EEE42675F066ECDAB8F27D08B78();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_6928CF91428C809D6751FAB33649CBD6();
	void AnimNotify_PT_Idle_BLD();
	void AnimNotify_PT_Idle_BRD();
	void AnimNotify_PT_Idle_Mid();
	void AnimNotify_PT_Invis_2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_1CCE0CE8417F73EF64D5FCA02021F8C8();
	void AnimNotify_PT_Invis_3();
	void AnimNotify_PT_Idle_FRD();
	void AnimNotify_PT_Idle_FLD();
	void AnimNotify_PT_Idle_X();
	void AnimNotify_PlayerKilled();
	void BlueprintBeginPlay();
	void OnPlushTrapStateChanged(class UPlushTrapState_C* PlushTrapState);
	void StartIdleTimer();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_7907F424440EDADB90EC71A9D0439840();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP_AnimGraphNode_TransitionResult_2182A2C24302B691AAB0198A59F6A9FB();
	void ExecuteUbergraph_Fun_With_PlushTrap_Anim_BP(int EntryPoint);
	void PlayerCanWin__DelegateSignature();
	void KillPlayer__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
