#pragma once

// Name: Freddys, Version: 4.2.1

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FunWithNMBB_ABP.FunWithNMBB_ABP_C
// 0x2800 (0x2B60 - 0x0360)
class UFunWithNMBB_ABP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_5F4F17884BC1A5006B1BFA94AEE86F7B;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54E276B7414F89D186BA598C282E2C80;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9E5342CA4A7D37B2781D369907C12A08;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_06BD63334D2BB35BF195F3A0AE209BA6;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_71F480A74FDC57C66F4610A3E2BF990C;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D45F0BCF4E213199E7D1188872F093A3;// 0x04C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B8B6FC8E40A48917A41337AC35973F6B;// 0x0510(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3D31138D4310C8610A644095DDA15304;// 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_82B9897546194E069013BF98E648ADF1;// 0x05A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5D1BDDA342A0A1701B009186E13875C4;// 0x05E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_785F0146406B856FFD46EEACE2ED2BD4;// 0x0630(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4ED7B4A84F75B2B119D33E9B52AAFD5F;// 0x0678(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B70FBC8E4F9AFD35159729AA1163DAD5;// 0x06C0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B279F5BF4358AF44A46BA2BED00132B9;// 0x0708(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A0EA452D4CA7ED2455309FBDBB75181E;// 0x0750(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_167AEE77441739DDD1C9959E64BE99F0;// 0x0798(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_376C74E240DB39B1BFF16E970285E0E9;// 0x07E0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44BE626A4FA6D63397F2A79A85826255;// 0x0828(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6D010F5F4AD50C46B06ABBBB642A3679;// 0x0870(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1010E3BF47BF4E0F0AAFD9915B8DBD76;// 0x08B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DFB63944A22176A9C13059EF6C510F8;// 0x0900(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_536F6328461334A477829DBA2EB2A7A0;// 0x0948(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_705CBF52465E32C0D15586A382825CF7;// 0x09E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_766639D542DA99CC17BB228FF37DC803;// 0x0A28(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7FEF503A4AF0B2202FD4ED96370944E6;// 0x0AC8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_98F086734E577F777BFB89875D6D3E69;// 0x0B08(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2D31636E4E06004DCF2AFDB9162DF1B8;// 0x0BA8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B32519374AAE25A8A0B51E80C870906A;// 0x0BE8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4446841E4D1577C0348363AE57280B78;// 0x0C88(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_9B86118A46801217DA302FA54B09C60C;// 0x0CC8(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_39440EE547CFA018DC7A6D9E8003B3A3;// 0x0D08(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_62F43B52450942075DD795BF513FB59D;// 0x0D48(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32CB51414D898FB404DC3191BE045687;// 0x0E80(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AAF409284F5BD41DD1E389B7D2B966AD;// 0x0F20(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_FA867FD346254D5B5BE75E8EFA2420E5;// 0x0F60(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4B694DA4433D0F7347F11EA52C1D66BB;// 0x0FA0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_721EBE7544E7DB2C1E3C10ADDC524F53;// 0x0FE0(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5048DFF24A7D6AAC3C937FAB72D22A08;// 0x1118(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_129E8ED14F996A7A21E0F8AA36781FD5;// 0x11B8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7B7B2A1E43D349415A3A6FB50297B29A;// 0x11F8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4C431B0B433143BFAE0CD4AFE2924C65;// 0x1298(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_87D32CBB44DB64365FA926BF945D1788;// 0x12D8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2A088B224B29AC4F11F4FB9EC03F8480;// 0x1378(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B18655146F038B1450E0CA3E22156EB;// 0x13B8(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CCA6C4264D9E1C93DA7E12A6E1849385;// 0x1458(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_01AE7D174226F124ABB6DEB445BCC862;// 0x1498(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5D94855E404C5CACE5DB5A8199A09869;// 0x14D8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0DBD157948CF6169AB598298EF93A551;// 0x1518(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F9580B1647CCE478B5EAE588BC52B4DA;// 0x1650(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7FFBDA7F4BEE0A3384C46CAD5741E5A9;// 0x16F0(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_484FBAC74666AEF0224EC3AD4BC20E8D;// 0x1730(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_954D94834DDD191982E270A83CC80EA5;// 0x1868(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_A03CAF524270D928989F3CA5B04E3D32;// 0x18A8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_65FA26F4423C3D8F79552D8E7475BDC9;// 0x18E8(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AD4160C74D465186308E3E868890582B;// 0x1A20(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_74C0DEEC4659D0AC0F87D6BB0F8AE6FA;// 0x1AC0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07BA23C348C39FEEA5608BA1866C8F78;// 0x1B00(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AAB2F0274EBAA48D543305B18B5D12D6;// 0x1BA0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3C1E59F844E2B82EB00889965A060CAD;// 0x1BE0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5AF856A542CC46347F3715A2EE2DF622;// 0x1C80(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C2CCC15F491018C8261DAE8C3F5FAC7E;// 0x1CC0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B40D7F9B4CEAC2B04CB0F0AFCDECE1D7;// 0x1D60(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E0BE6D384D3287E339F804B2BAFAC2AD;// 0x1DA0(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BBFBCAEC4DB478DDAE1378AA47F07423;// 0x1E40(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C1B001D74245AA7CCAB44C9A96EE228A;// 0x1E80(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4E424970475AE4CD9A865080828ADF93;// 0x1EC0(0x0138)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_59DC38BF4D1CE0E27A442F90333DF0AE;// 0x1FF8(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_42695DEC41A4532F60A01E982E829D23;// 0x2038(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3E4DD62F4DAB38A78C4E19BD57531E3A;// 0x2078(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EE9599B141309B61FABF8D91F8A9503E;// 0x20B8(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_68793AC642AFC55F0A8A3B9114133A45;// 0x21F0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7699E235478BE9132F5FCCB6B00232D6;// 0x2290(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0BEAEDAA42F47F87B85FE38AD5D5B2AB;// 0x22D0(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5A9A1B034BB4AB1B0C9A7DB705480B43;// 0x2408(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_025D153F4F2AC43EBC652A9C3B9686D8;// 0x24A8(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F5F9E8FE4063E6520AFE768E0436E24A;// 0x24E8(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DD32A83042B21420E1E9D09B03D080E5;// 0x2528(0x0138)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D5FA5C8F46369049B413088E5855E87C;// 0x2660(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_746C8E494055BB9CA74CF3A889B30954;// 0x26A0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCF43D4144C27491BB96698FA94D0C6C;// 0x2740(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E7A618F44932826AE0537F9C63A7CADB;// 0x2780(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_98F1EB1C46CFE29A5BCB34B58B646ADE;// 0x2820(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EB5282174209AC2C665D0D8E03CD429A;// 0x2860(0x00E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E56FBE5649F70253FB0BE38EDCC96DCA;// 0x2940(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0A4185A0428068FCB5C49CBB595428E2;// 0x2A78(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D33611234E11DD3DC1C1A08A719D743B;// 0x2AB8(0x0040)
	class UPlushTrapState_C*                           PlushTrapChanged;                                         // 0x2AF8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ChooseDirection;                                          // 0x2B00(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x2B04(0x0004) MISSED OFFSET
	struct FTimerHandle                                TimerHandle;                                              // 0x2B08(0x0008) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                               CurrentAnimSeq;                                           // 0x2B10(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               NextAnimSeq;                                              // 0x2B18(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsOnX;                                                    // 0x2B20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayerWon;                                                // 0x2B21(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x2B22(0x0002) MISSED OFFSET
	float                                              SetMinTime;                                               // 0x2B24(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SetMaxTime;                                               // 0x2B28(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TransitionPlayRate;                                       // 0x2B2C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    HatSpinRotation;                                          // 0x2B30(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Count;                                                    // 0x2B3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TipRate;                                                  // 0x2B40(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TipAmount;                                                // 0x2B44(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpinRate;                                                 // 0x2B48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    HeadShake;                                                // 0x2B4C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TransDelay;                                               // 0x2B58(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Animation_Start_Position;                                 // 0x2B5C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass FunWithNMBB_ABP.FunWithNMBB_ABP_C");
		return ptr;
	}


	void ChangeStateToIdle();
	void ResetTimer();
	void ChangeStateToMove();
	void Fun_With_Plush_Trap_BP_Ref(class AFun_With_PlushTrap_BP_C** Fun_with_PlushTrap_BP_Ref);
	void ProcessMoveState();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_A0EA452D4CA7ED2455309FBDBB75181E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_B279F5BF4358AF44A46BA2BED00132B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_B70FBC8E4F9AFD35159729AA1163DAD5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_4ED7B4A84F75B2B119D33E9B52AAFD5F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_0DFB63944A22176A9C13059EF6C510F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_785F0146406B856FFD46EEACE2ED2BD4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_5D1BDDA342A0A1701B009186E13875C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_82B9897546194E069013BF98E648ADF1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_3D31138D4310C8610A644095DDA15304();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_1010E3BF47BF4E0F0AAFD9915B8DBD76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_B8B6FC8E40A48917A41337AC35973F6B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_D45F0BCF4E213199E7D1188872F093A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_71F480A74FDC57C66F4610A3E2BF990C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_06BD63334D2BB35BF195F3A0AE209BA6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_9E5342CA4A7D37B2781D369907C12A08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_167AEE77441739DDD1C9959E64BE99F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_54E276B7414F89D186BA598C282E2C80();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_6D010F5F4AD50C46B06ABBBB642A3679();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_44BE626A4FA6D63397F2A79A85826255();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FunWithNMBB_ABP_AnimGraphNode_TransitionResult_376C74E240DB39B1BFF16E970285E0E9();
	void AnimNotify_PlayerKilled();
	void AnimNotify_BB_Idle_Chair();
	void AnimNotify_BB_Idle_Back();
	void AnimNotify_BB_Idle_Invis();
	void AnimNotify_BB_Idle_Mid();
	void AnimNotify_BB_Invis2();
	void AnimNotify_BB_Idle_OnX();
	void AnimNotify_BB_BLD();
	void AnimNotify_BB_FLD();
	void AnimNotify_BB_FRD();
	void AnimNotify_BB_BRD();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void OnPlushTrapStateChanged(class UPlushTrapState_C* PlushTrapState);
	void StartIdleTimer();
	void Initialize();
	void ExecuteUbergraph_FunWithNMBB_ABP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
